zhixiangqi/CN_FW_FORD132CD542_APP_MCU/bsps/TARGET_FORD132_CD542_CY8C4147AZS-S285_POSA/config/GeneratedSource/cycfg_pins.h
/*******************************************************************************
 * File Name: cycfg_pins.h
 *
 * Description:
 * Pin configuration
 * This file was automatically generated and should not be modified.
 * Configurator Backend 3.30.0
 * device-db 4.17.0.6514
 * mtb-pdl-cat2 2.12.0.12916
 *
 *******************************************************************************
 * Copyright 2024 Cypress Semiconductor Corporation (an Infineon company) or
 * an affiliate of Cypress Semiconductor Corporation.
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 ******************************************************************************/

#if !defined(CYCFG_PINS_H)
#define CYCFG_PINS_H

#include "cycfg_notices.h"
#include "cy_gpio.h"
#include "cycfg_routing.h"

#if defined (CY_USING_HAL)
#include "cyhal_hwmgr.h"
#endif /* defined (CY_USING_HAL) */

#if defined(__cplusplus)
extern "C" {
#endif /* defined(__cplusplus) */

#define PCBA_A0_ENABLED 1U
#define PCBA_A0_PORT GPIO_PRT0
#define PCBA_A0_PORT_NUM 0U
#define PCBA_A0_PIN 0U
#define PCBA_A0_NUM 0U
#define PCBA_A0_DRIVEMODE CY_GPIO_DM_HIGHZ
#define PCBA_A0_INIT_DRIVESTATE 0
#ifndef ioss_0_port_0_pin_0_HSIOM
    #define ioss_0_port_0_pin_0_HSIOM HSIOM_SEL_GPIO
#endif
#define PCBA_A0_HSIOM ioss_0_port_0_pin_0_HSIOM
#define PCBA_A0_IRQ ioss_interrupts_gpio_0_IRQn

#if defined (CY_USING_HAL)
#define PCBA_A0_HAL_PORT_PIN P0_0
#define PCBA_A0 P0_0
#define PCBA_A0_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define PCBA_A0_HAL_DIR CYHAL_GPIO_DIR_INPUT 
#define PCBA_A0_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_NONE
#endif /* defined (CY_USING_HAL) */

#define PCBA_A1_ENABLED 1U
#define PCBA_A1_PORT GPIO_PRT0
#define PCBA_A1_PORT_NUM 0U
#define PCBA_A1_PIN 1U
#define PCBA_A1_NUM 1U
#define PCBA_A1_DRIVEMODE CY_GPIO_DM_HIGHZ
#define PCBA_A1_INIT_DRIVESTATE 0
#ifndef ioss_0_port_0_pin_1_HSIOM
    #define ioss_0_port_0_pin_1_HSIOM HSIOM_SEL_GPIO
#endif
#define PCBA_A1_HSIOM ioss_0_port_0_pin_1_HSIOM
#define PCBA_A1_IRQ ioss_interrupts_gpio_0_IRQn

#if defined (CY_USING_HAL)
#define PCBA_A1_HAL_PORT_PIN P0_1
#define PCBA_A1 P0_1
#define PCBA_A1_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define PCBA_A1_HAL_DIR CYHAL_GPIO_DIR_INPUT 
#define PCBA_A1_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_NONE
#endif /* defined (CY_USING_HAL) */

#define PCBA_A2_ENABLED 1U
#define PCBA_A2_PORT GPIO_PRT0
#define PCBA_A2_PORT_NUM 0U
#define PCBA_A2_PIN 2U
#define PCBA_A2_NUM 2U
#define PCBA_A2_DRIVEMODE CY_GPIO_DM_HIGHZ
#define PCBA_A2_INIT_DRIVESTATE 0
#ifndef ioss_0_port_0_pin_2_HSIOM
    #define ioss_0_port_0_pin_2_HSIOM HSIOM_SEL_GPIO
#endif
#define PCBA_A2_HSIOM ioss_0_port_0_pin_2_HSIOM
#define PCBA_A2_IRQ ioss_interrupts_gpio_0_IRQn

#if defined (CY_USING_HAL)
#define PCBA_A2_HAL_PORT_PIN P0_2
#define PCBA_A2 P0_2
#define PCBA_A2_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define PCBA_A2_HAL_DIR CYHAL_GPIO_DIR_INPUT 
#define PCBA_A2_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_NONE
#endif /* defined (CY_USING_HAL) */

#define PCBA_A3_ENABLED 1U
#define PCBA_A3_PORT GPIO_PRT0
#define PCBA_A3_PORT_NUM 0U
#define PCBA_A3_PIN 3U
#define PCBA_A3_NUM 3U
#define PCBA_A3_DRIVEMODE CY_GPIO_DM_HIGHZ
#define PCBA_A3_INIT_DRIVESTATE 0
#ifndef ioss_0_port_0_pin_3_HSIOM
    #define ioss_0_port_0_pin_3_HSIOM HSIOM_SEL_GPIO
#endif
#define PCBA_A3_HSIOM ioss_0_port_0_pin_3_HSIOM
#define PCBA_A3_IRQ ioss_interrupts_gpio_0_IRQn

#if defined (CY_USING_HAL)
#define PCBA_A3_HAL_PORT_PIN P0_3
#define PCBA_A3 P0_3
#define PCBA_A3_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define PCBA_A3_HAL_DIR CYHAL_GPIO_DIR_INPUT 
#define PCBA_A3_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_NONE
#endif /* defined (CY_USING_HAL) */

#define RTC_WCO_IN_ENABLED 1U
#define RTC_WCO_IN_PORT GPIO_PRT0
#define RTC_WCO_IN_PORT_NUM 0U
#define RTC_WCO_IN_PIN 4U
#define RTC_WCO_IN_NUM 4U
#define RTC_WCO_IN_DRIVEMODE CY_GPIO_DM_ANALOG
#define RTC_WCO_IN_INIT_DRIVESTATE 1
#ifndef ioss_0_port_0_pin_4_HSIOM
    #define ioss_0_port_0_pin_4_HSIOM HSIOM_SEL_GPIO
#endif
#define RTC_WCO_IN_HSIOM ioss_0_port_0_pin_4_HSIOM
#define RTC_WCO_IN_IRQ ioss_interrupts_gpio_0_IRQn

#if defined (CY_USING_HAL)
#define RTC_WCO_IN_HAL_PORT_PIN P0_4
#define RTC_WCO_IN P0_4
#define RTC_WCO_IN_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define RTC_WCO_IN_HAL_DIR CYHAL_GPIO_DIR_INPUT 
#define RTC_WCO_IN_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_ANALOG
#endif /* defined (CY_USING_HAL) */

#define RTC_WCO_OUT_ENABLED 1U
#define RTC_WCO_OUT_PORT GPIO_PRT0
#define RTC_WCO_OUT_PORT_NUM 0U
#define RTC_WCO_OUT_PIN 5U
#define RTC_WCO_OUT_NUM 5U
#define RTC_WCO_OUT_DRIVEMODE CY_GPIO_DM_ANALOG
#define RTC_WCO_OUT_INIT_DRIVESTATE 1
#ifndef ioss_0_port_0_pin_5_HSIOM
    #define ioss_0_port_0_pin_5_HSIOM HSIOM_SEL_GPIO
#endif
#define RTC_WCO_OUT_HSIOM ioss_0_port_0_pin_5_HSIOM
#define RTC_WCO_OUT_IRQ ioss_interrupts_gpio_0_IRQn

#if defined (CY_USING_HAL)
#define RTC_WCO_OUT_HAL_PORT_PIN P0_5
#define RTC_WCO_OUT P0_5
#define RTC_WCO_OUT_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define RTC_WCO_OUT_HAL_DIR CYHAL_GPIO_DIR_INPUT 
#define RTC_WCO_OUT_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_ANALOG
#endif /* defined (CY_USING_HAL) */

#define P1V2_EN_ENABLED 1U
#define P1V2_EN_PORT GPIO_PRT0
#define P1V2_EN_PORT_NUM 0U
#define P1V2_EN_PIN 6U
#define P1V2_EN_NUM 6U
#define P1V2_EN_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define P1V2_EN_INIT_DRIVESTATE 0
#ifndef ioss_0_port_0_pin_6_HSIOM
    #define ioss_0_port_0_pin_6_HSIOM HSIOM_SEL_GPIO
#endif
#define P1V2_EN_HSIOM ioss_0_port_0_pin_6_HSIOM
#define P1V2_EN_IRQ ioss_interrupts_gpio_0_IRQn

#if defined (CY_USING_HAL)
#define P1V2_EN_HAL_PORT_PIN P0_6
#define P1V2_EN P0_6
#define P1V2_EN_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define P1V2_EN_HAL_DIR CYHAL_GPIO_DIR_OUTPUT 
#define P1V2_EN_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_STRONG
#endif /* defined (CY_USING_HAL) */

#define P1V2_PG_ENABLED 1U
#define P1V2_PG_PORT GPIO_PRT0
#define P1V2_PG_PORT_NUM 0U
#define P1V2_PG_PIN 7U
#define P1V2_PG_NUM 7U
#define P1V2_PG_DRIVEMODE CY_GPIO_DM_HIGHZ
#define P1V2_PG_INIT_DRIVESTATE 1
#ifndef ioss_0_port_0_pin_7_HSIOM
    #define ioss_0_port_0_pin_7_HSIOM HSIOM_SEL_GPIO
#endif
#define P1V2_PG_HSIOM ioss_0_port_0_pin_7_HSIOM
#define P1V2_PG_IRQ ioss_interrupts_gpio_0_IRQn

#if defined (CY_USING_HAL)
#define P1V2_PG_HAL_PORT_PIN P0_7
#define P1V2_PG P0_7
#define P1V2_PG_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define P1V2_PG_HAL_DIR CYHAL_GPIO_DIR_INPUT 
#define P1V2_PG_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_NONE
#endif /* defined (CY_USING_HAL) */

#define BIAS_FAULT_ENABLED 1U
#define BIAS_FAULT_PORT GPIO_PRT1
#define BIAS_FAULT_PORT_NUM 1U
#define BIAS_FAULT_PIN 0U
#define BIAS_FAULT_NUM 0U
#define BIAS_FAULT_DRIVEMODE CY_GPIO_DM_HIGHZ
#define BIAS_FAULT_INIT_DRIVESTATE 1
#ifndef ioss_0_port_1_pin_0_HSIOM
    #define ioss_0_port_1_pin_0_HSIOM HSIOM_SEL_GPIO
#endif
#define BIAS_FAULT_HSIOM ioss_0_port_1_pin_0_HSIOM
#define BIAS_FAULT_IRQ ioss_interrupts_gpio_1_IRQn

#if defined (CY_USING_HAL)
#define BIAS_FAULT_HAL_PORT_PIN P1_0
#define BIAS_FAULT P1_0
#define BIAS_FAULT_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define BIAS_FAULT_HAL_DIR CYHAL_GPIO_DIR_INPUT 
#define BIAS_FAULT_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_NONE
#endif /* defined (CY_USING_HAL) */

#define BIAS_EN_ENABLED 1U
#define BIAS_EN_PORT GPIO_PRT1
#define BIAS_EN_PORT_NUM 1U
#define BIAS_EN_PIN 1U
#define BIAS_EN_NUM 1U
#define BIAS_EN_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define BIAS_EN_INIT_DRIVESTATE 0
#ifndef ioss_0_port_1_pin_1_HSIOM
    #define ioss_0_port_1_pin_1_HSIOM HSIOM_SEL_GPIO
#endif
#define BIAS_EN_HSIOM ioss_0_port_1_pin_1_HSIOM
#define BIAS_EN_IRQ ioss_interrupts_gpio_1_IRQn

#if defined (CY_USING_HAL)
#define BIAS_EN_HAL_PORT_PIN P1_1
#define BIAS_EN P1_1
#define BIAS_EN_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define BIAS_EN_HAL_DIR CYHAL_GPIO_DIR_OUTPUT 
#define BIAS_EN_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_STRONG
#endif /* defined (CY_USING_HAL) */

