zhixiangqi/CN_FW_FORD132CD542_APP_MCU/bsps/TARGET_FORD132_CD542_CY8C4147AZS-S285_POSA/config/GeneratedSource/cycfg_pins.h
#define DES_I2C_SCL_ENABLED 1U
#define DES_I2C_SCL_PORT GPIO_PRT1
#define DES_I2C_SCL_PORT_NUM 1U
#define DES_I2C_SCL_PIN 2U
#define DES_I2C_SCL_NUM 2U
#define DES_I2C_SCL_DRIVEMODE CY_GPIO_DM_OD_DRIVESLOW
#define DES_I2C_SCL_INIT_DRIVESTATE 1
#ifndef ioss_0_port_1_pin_2_HSIOM
    #define ioss_0_port_1_pin_2_HSIOM HSIOM_SEL_GPIO
#endif
#define DES_I2C_SCL_HSIOM ioss_0_port_1_pin_2_HSIOM
#define DES_I2C_SCL_IRQ ioss_interrupts_gpio_1_IRQn

#if defined (CY_USING_HAL)
#define DES_I2C_SCL_HAL_PORT_PIN P1_2
#define DES_I2C_SCL P1_2
#define DES_I2C_SCL_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define DES_I2C_SCL_HAL_DIR CYHAL_GPIO_DIR_BIDIRECTIONAL 
#define DES_I2C_SCL_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_OPENDRAINDRIVESLOW
#endif /* defined (CY_USING_HAL) */

#define DES_I2C_SDA_ENABLED 1U
#define DES_I2C_SDA_PORT GPIO_PRT1
#define DES_I2C_SDA_PORT_NUM 1U
#define DES_I2C_SDA_PIN 3U
#define DES_I2C_SDA_NUM 3U
#define DES_I2C_SDA_DRIVEMODE CY_GPIO_DM_OD_DRIVESLOW
#define DES_I2C_SDA_INIT_DRIVESTATE 1
#ifndef ioss_0_port_1_pin_3_HSIOM
    #define ioss_0_port_1_pin_3_HSIOM HSIOM_SEL_GPIO
#endif
#define DES_I2C_SDA_HSIOM ioss_0_port_1_pin_3_HSIOM
#define DES_I2C_SDA_IRQ ioss_interrupts_gpio_1_IRQn

#if defined (CY_USING_HAL)
#define DES_I2C_SDA_HAL_PORT_PIN P1_3
#define DES_I2C_SDA P1_3
#define DES_I2C_SDA_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define DES_I2C_SDA_HAL_DIR CYHAL_GPIO_DIR_BIDIRECTIONAL 
#define DES_I2C_SDA_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_OPENDRAINDRIVESLOW
#endif /* defined (CY_USING_HAL) */

#define ioss_0_port_1_pin_7_ENABLED 1U
#define ioss_0_port_1_pin_7_PORT GPIO_PRT1
#define ioss_0_port_1_pin_7_PORT_NUM 1U
#define ioss_0_port_1_pin_7_PIN 7U
#define ioss_0_port_1_pin_7_NUM 7U
#define ioss_0_port_1_pin_7_DRIVEMODE CY_GPIO_DM_ANALOG
#define ioss_0_port_1_pin_7_INIT_DRIVESTATE 1
#ifndef ioss_0_port_1_pin_7_HSIOM
    #define ioss_0_port_1_pin_7_HSIOM HSIOM_SEL_GPIO
#endif
#define ioss_0_port_1_pin_7_IRQ ioss_interrupts_gpio_1_IRQn

#if defined (CY_USING_HAL)
#define ioss_0_port_1_pin_7_HAL_PORT_PIN P1_7
#define ioss_0_port_1_pin_7 P1_7
#define ioss_0_port_1_pin_7_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define ioss_0_port_1_pin_7_HAL_DIR CYHAL_GPIO_DIR_INPUT 
#define ioss_0_port_1_pin_7_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_ANALOG
#endif /* defined (CY_USING_HAL) */

#define ADC_PCBTEMP_ENABLED 1U
#define ADC_PCBTEMP_PORT GPIO_PRT2
#define ADC_PCBTEMP_PORT_NUM 2U
#define ADC_PCBTEMP_PIN 0U
#define ADC_PCBTEMP_NUM 0U
#define ADC_PCBTEMP_DRIVEMODE CY_GPIO_DM_ANALOG
#define ADC_PCBTEMP_INIT_DRIVESTATE 1
#ifndef ioss_0_port_2_pin_0_HSIOM
    #define ioss_0_port_2_pin_0_HSIOM HSIOM_SEL_GPIO
#endif
#define ADC_PCBTEMP_HSIOM ioss_0_port_2_pin_0_HSIOM
#define ADC_PCBTEMP_IRQ ioss_interrupts_gpio_2_IRQn

#if defined (CY_USING_HAL)
#define ADC_PCBTEMP_HAL_PORT_PIN P2_0
#define ADC_PCBTEMP P2_0
#define ADC_PCBTEMP_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define ADC_PCBTEMP_HAL_DIR CYHAL_GPIO_DIR_INPUT 
#define ADC_PCBTEMP_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_ANALOG
#endif /* defined (CY_USING_HAL) */

#define ADC_BLTTEMP_ENABLED 1U
#define ADC_BLTTEMP_PORT GPIO_PRT2
#define ADC_BLTTEMP_PORT_NUM 2U
#define ADC_BLTTEMP_PIN 1U
#define ADC_BLTTEMP_NUM 1U
#define ADC_BLTTEMP_DRIVEMODE CY_GPIO_DM_ANALOG
#define ADC_BLTTEMP_INIT_DRIVESTATE 1
#ifndef ioss_0_port_2_pin_1_HSIOM
    #define ioss_0_port_2_pin_1_HSIOM HSIOM_SEL_GPIO
#endif
#define ADC_BLTTEMP_HSIOM ioss_0_port_2_pin_1_HSIOM
#define ADC_BLTTEMP_IRQ ioss_interrupts_gpio_2_IRQn

#if defined (CY_USING_HAL)
#define ADC_BLTTEMP_HAL_PORT_PIN P2_1
#define ADC_BLTTEMP P2_1
#define ADC_BLTTEMP_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define ADC_BLTTEMP_HAL_DIR CYHAL_GPIO_DIR_INPUT 
#define ADC_BLTTEMP_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_ANALOG
#endif /* defined (CY_USING_HAL) */

#define ADC_BATTVOLT_ENABLED 1U
#define ADC_BATTVOLT_PORT GPIO_PRT2
#define ADC_BATTVOLT_PORT_NUM 2U
#define ADC_BATTVOLT_PIN 2U
#define ADC_BATTVOLT_NUM 2U
#define ADC_BATTVOLT_DRIVEMODE CY_GPIO_DM_ANALOG
#define ADC_BATTVOLT_INIT_DRIVESTATE 1
#ifndef ioss_0_port_2_pin_2_HSIOM
    #define ioss_0_port_2_pin_2_HSIOM HSIOM_SEL_GPIO
#endif
#define ADC_BATTVOLT_HSIOM ioss_0_port_2_pin_2_HSIOM
#define ADC_BATTVOLT_IRQ ioss_interrupts_gpio_2_IRQn

#if defined (CY_USING_HAL)
#define ADC_BATTVOLT_HAL_PORT_PIN P2_2
#define ADC_BATTVOLT P2_2
#define ADC_BATTVOLT_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define ADC_BATTVOLT_HAL_DIR CYHAL_GPIO_DIR_INPUT 
#define ADC_BATTVOLT_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_ANALOG
#endif /* defined (CY_USING_HAL) */

#define ADC_SYNCCHECK_ENABLED 1U
#define ADC_SYNCCHECK_PORT GPIO_PRT2
#define ADC_SYNCCHECK_PORT_NUM 2U
#define ADC_SYNCCHECK_PIN 3U
#define ADC_SYNCCHECK_NUM 3U
#define ADC_SYNCCHECK_DRIVEMODE CY_GPIO_DM_ANALOG
#define ADC_SYNCCHECK_INIT_DRIVESTATE 1
#ifndef ioss_0_port_2_pin_3_HSIOM
    #define ioss_0_port_2_pin_3_HSIOM HSIOM_SEL_GPIO
#endif
#define ADC_SYNCCHECK_HSIOM ioss_0_port_2_pin_3_HSIOM
#define ADC_SYNCCHECK_IRQ ioss_interrupts_gpio_2_IRQn

#if defined (CY_USING_HAL)
#define ADC_SYNCCHECK_HAL_PORT_PIN P2_3
#define ADC_SYNCCHECK P2_3
#define ADC_SYNCCHECK_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define ADC_SYNCCHECK_HAL_DIR CYHAL_GPIO_DIR_INPUT 
#define ADC_SYNCCHECK_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_ANALOG
#endif /* defined (CY_USING_HAL) */

#define FPC_DET_TX_LOUT_ENABLED 1U
#define FPC_DET_TX_LOUT_PORT GPIO_PRT2
#define FPC_DET_TX_LOUT_PORT_NUM 2U
#define FPC_DET_TX_LOUT_PIN 4U
#define FPC_DET_TX_LOUT_NUM 4U
#define FPC_DET_TX_LOUT_DRIVEMODE CY_GPIO_DM_HIGHZ
#define FPC_DET_TX_LOUT_INIT_DRIVESTATE 0
#ifndef ioss_0_port_2_pin_4_HSIOM
    #define ioss_0_port_2_pin_4_HSIOM HSIOM_SEL_GPIO
#endif
#define FPC_DET_TX_LOUT_HSIOM ioss_0_port_2_pin_4_HSIOM
#define FPC_DET_TX_LOUT_IRQ ioss_interrupts_gpio_2_IRQn

#if defined (CY_USING_HAL)
#define FPC_DET_TX_LOUT_HAL_PORT_PIN P2_4
#define FPC_DET_TX_LOUT P2_4
#define FPC_DET_TX_LOUT_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define FPC_DET_TX_LOUT_HAL_DIR CYHAL_GPIO_DIR_INPUT 
#define FPC_DET_TX_LOUT_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_NONE
#endif /* defined (CY_USING_HAL) */

#define FPC_DET_RX_ROUT_ENABLED 1U
#define FPC_DET_RX_ROUT_PORT GPIO_PRT2
#define FPC_DET_RX_ROUT_PORT_NUM 2U
#define FPC_DET_RX_ROUT_PIN 5U
#define FPC_DET_RX_ROUT_NUM 5U
#define FPC_DET_RX_ROUT_DRIVEMODE CY_GPIO_DM_HIGHZ
#define FPC_DET_RX_ROUT_INIT_DRIVESTATE 0
#ifndef ioss_0_port_2_pin_5_HSIOM
    #define ioss_0_port_2_pin_5_HSIOM HSIOM_SEL_GPIO
#endif
#define FPC_DET_RX_ROUT_HSIOM ioss_0_port_2_pin_5_HSIOM
#define FPC_DET_RX_ROUT_IRQ ioss_interrupts_gpio_2_IRQn

#if defined (CY_USING_HAL)
#define FPC_DET_RX_ROUT_HAL_PORT_PIN P2_5
#define FPC_DET_RX_ROUT P2_5
#define FPC_DET_RX_ROUT_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define FPC_DET_RX_ROUT_HAL_DIR CYHAL_GPIO_DIR_INPUT 
#define FPC_DET_RX_ROUT_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_NONE
#endif /* defined (CY_USING_HAL) */

#define DES_LOCK_ENABLED 1U
#define DES_LOCK_PORT GPIO_PRT2
#define DES_LOCK_PORT_NUM 2U
#define DES_LOCK_PIN 6U
#define DES_LOCK_NUM 6U
#define DES_LOCK_DRIVEMODE CY_GPIO_DM_HIGHZ
#define DES_LOCK_INIT_DRIVESTATE 0
#ifndef ioss_0_port_2_pin_6_HSIOM
    #define ioss_0_port_2_pin_6_HSIOM HSIOM_SEL_GPIO
#endif
#define DES_LOCK_HSIOM ioss_0_port_2_pin_6_HSIOM
#define DES_LOCK_IRQ ioss_interrupts_gpio_2_IRQn

#if defined (CY_USING_HAL)
#define DES_LOCK_HAL_PORT_PIN P2_6
#define DES_LOCK P2_6
#define DES_LOCK_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define DES_LOCK_HAL_DIR CYHAL_GPIO_DIR_INPUT 
#define DES_LOCK_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_NONE
#endif /* defined (CY_USING_HAL) */

#define DES_PASS_ENABLED 1U
#define DES_PASS_PORT GPIO_PRT2
#define DES_PASS_PORT_NUM 2U
#define DES_PASS_PIN 7U
#define DES_PASS_NUM 7U
#define DES_PASS_DRIVEMODE CY_GPIO_DM_HIGHZ
#define DES_PASS_INIT_DRIVESTATE 0
#ifndef ioss_0_port_2_pin_7_HSIOM
    #define ioss_0_port_2_pin_7_HSIOM HSIOM_SEL_GPIO
#endif
#define DES_PASS_HSIOM ioss_0_port_2_pin_7_HSIOM
#define DES_PASS_IRQ ioss_interrupts_gpio_2_IRQn

#if defined (CY_USING_HAL)
#define DES_PASS_HAL_PORT_PIN P2_7
#define DES_PASS P2_7
#define DES_PASS_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define DES_PASS_HAL_DIR CYHAL_GPIO_DIR_INPUT 
#define DES_PASS_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_NONE
#endif /* defined (CY_USING_HAL) */

