zhixiangqi/CN_FW_FORD132CD542_APP_MCU/bsps/TARGET_FORD132_CD542_CY8C4147AZS-S285_POSA/config/GeneratedSource/cycfg_pins.h
#define EXFLASH_WP_ENABLED 1U
#define EXFLASH_WP_PORT GPIO_PRT3
#define EXFLASH_WP_PORT_NUM 3U
#define EXFLASH_WP_PIN 0U
#define EXFLASH_WP_NUM 0U
#define EXFLASH_WP_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define EXFLASH_WP_INIT_DRIVESTATE 0
#ifndef ioss_0_port_3_pin_0_HSIOM
    #define ioss_0_port_3_pin_0_HSIOM HSIOM_SEL_GPIO
#endif
#define EXFLASH_WP_HSIOM ioss_0_port_3_pin_0_HSIOM
#define EXFLASH_WP_IRQ ioss_interrupts_gpio_3_IRQn

#if defined (CY_USING_HAL)
#define EXFLASH_WP_HAL_PORT_PIN P3_0
#define EXFLASH_WP P3_0
#define EXFLASH_WP_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define EXFLASH_WP_HAL_DIR CYHAL_GPIO_DIR_OUTPUT 
#define EXFLASH_WP_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_STRONG
#endif /* defined (CY_USING_HAL) */

#define DISP_FAULT_ENABLED 1U
#define DISP_FAULT_PORT GPIO_PRT3
#define DISP_FAULT_PORT_NUM 3U
#define DISP_FAULT_PIN 1U
#define DISP_FAULT_NUM 1U
#define DISP_FAULT_DRIVEMODE CY_GPIO_DM_HIGHZ
#define DISP_FAULT_INIT_DRIVESTATE 0
#ifndef ioss_0_port_3_pin_1_HSIOM
    #define ioss_0_port_3_pin_1_HSIOM HSIOM_SEL_GPIO
#endif
#define DISP_FAULT_HSIOM ioss_0_port_3_pin_1_HSIOM
#define DISP_FAULT_IRQ ioss_interrupts_gpio_3_IRQn

#if defined (CY_USING_HAL)
#define DISP_FAULT_HAL_PORT_PIN P3_1
#define DISP_FAULT P3_1
#define DISP_FAULT_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define DISP_FAULT_HAL_DIR CYHAL_GPIO_DIR_INPUT 
#define DISP_FAULT_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_NONE
#endif /* defined (CY_USING_HAL) */

#define MCU_SWDIO_ENABLED 1U
#define MCU_SWDIO_PORT GPIO_PRT3
#define MCU_SWDIO_PORT_NUM 3U
#define MCU_SWDIO_PIN 2U
#define MCU_SWDIO_NUM 2U
#define MCU_SWDIO_DRIVEMODE CY_GPIO_DM_STRONG
#define MCU_SWDIO_INIT_DRIVESTATE 1
#ifndef ioss_0_port_3_pin_2_HSIOM
    #define ioss_0_port_3_pin_2_HSIOM HSIOM_SEL_GPIO
#endif
#define MCU_SWDIO_HSIOM ioss_0_port_3_pin_2_HSIOM
#define MCU_SWDIO_IRQ ioss_interrupts_gpio_3_IRQn

#if defined (CY_USING_HAL)
#define MCU_SWDIO_HAL_PORT_PIN P3_2
#define MCU_SWDIO P3_2
#define MCU_SWDIO_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define MCU_SWDIO_HAL_DIR CYHAL_GPIO_DIR_BIDIRECTIONAL 
#define MCU_SWDIO_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_STRONG
#endif /* defined (CY_USING_HAL) */

#define MCU_SWCLK_ENABLED 1U
#define MCU_SWCLK_PORT GPIO_PRT3
#define MCU_SWCLK_PORT_NUM 3U
#define MCU_SWCLK_PIN 3U
#define MCU_SWCLK_NUM 3U
#define MCU_SWCLK_DRIVEMODE CY_GPIO_DM_STRONG
#define MCU_SWCLK_INIT_DRIVESTATE 1
#ifndef ioss_0_port_3_pin_3_HSIOM
    #define ioss_0_port_3_pin_3_HSIOM HSIOM_SEL_GPIO
#endif
#define MCU_SWCLK_HSIOM ioss_0_port_3_pin_3_HSIOM
#define MCU_SWCLK_IRQ ioss_interrupts_gpio_3_IRQn

#if defined (CY_USING_HAL)
#define MCU_SWCLK_HAL_PORT_PIN P3_3
#define MCU_SWCLK P3_3
#define MCU_SWCLK_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define MCU_SWCLK_HAL_DIR CYHAL_GPIO_DIR_BIDIRECTIONAL 
#define MCU_SWCLK_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_STRONG
#endif /* defined (CY_USING_HAL) */

#define U301_TSC_ATTN_ENABLED 1U
#define U301_TSC_ATTN_PORT GPIO_PRT3
#define U301_TSC_ATTN_PORT_NUM 3U
#define U301_TSC_ATTN_PIN 4U
#define U301_TSC_ATTN_NUM 4U
#define U301_TSC_ATTN_DRIVEMODE CY_GPIO_DM_HIGHZ
#define U301_TSC_ATTN_INIT_DRIVESTATE 1
#ifndef ioss_0_port_3_pin_4_HSIOM
    #define ioss_0_port_3_pin_4_HSIOM HSIOM_SEL_GPIO
#endif
#define U301_TSC_ATTN_HSIOM ioss_0_port_3_pin_4_HSIOM
#define U301_TSC_ATTN_IRQ ioss_interrupts_gpio_3_IRQn

#if defined (CY_USING_HAL)
#define U301_TSC_ATTN_HAL_PORT_PIN P3_4
#define U301_TSC_ATTN P3_4
#define U301_TSC_ATTN_HAL_IRQ CYHAL_GPIO_IRQ_BOTH
#define U301_TSC_ATTN_HAL_DIR CYHAL_GPIO_DIR_INPUT 
#define U301_TSC_ATTN_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_NONE
#endif /* defined (CY_USING_HAL) */

#define U301_TSC_RESET_ENABLED 1U
#define U301_TSC_RESET_PORT GPIO_PRT3
#define U301_TSC_RESET_PORT_NUM 3U
#define U301_TSC_RESET_PIN 5U
#define U301_TSC_RESET_NUM 5U
#define U301_TSC_RESET_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define U301_TSC_RESET_INIT_DRIVESTATE 0
#ifndef ioss_0_port_3_pin_5_HSIOM
    #define ioss_0_port_3_pin_5_HSIOM HSIOM_SEL_GPIO
#endif
#define U301_TSC_RESET_HSIOM ioss_0_port_3_pin_5_HSIOM
#define U301_TSC_RESET_IRQ ioss_interrupts_gpio_3_IRQn

#if defined (CY_USING_HAL)
#define U301_TSC_RESET_HAL_PORT_PIN P3_5
#define U301_TSC_RESET P3_5
#define U301_TSC_RESET_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define U301_TSC_RESET_HAL_DIR CYHAL_GPIO_DIR_OUTPUT 
#define U301_TSC_RESET_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_STRONG
#endif /* defined (CY_USING_HAL) */

#define DDIC_WP_ENABLED 1U
#define DDIC_WP_PORT GPIO_PRT3
#define DDIC_WP_PORT_NUM 3U
#define DDIC_WP_PIN 6U
#define DDIC_WP_NUM 6U
#define DDIC_WP_DRIVEMODE CY_GPIO_DM_PULLDOWN_IN_OFF
#define DDIC_WP_INIT_DRIVESTATE 0
#ifndef ioss_0_port_3_pin_6_HSIOM
    #define ioss_0_port_3_pin_6_HSIOM HSIOM_SEL_GPIO
#endif
#define DDIC_WP_HSIOM ioss_0_port_3_pin_6_HSIOM
#define DDIC_WP_IRQ ioss_interrupts_gpio_3_IRQn

#if defined (CY_USING_HAL)
#define DDIC_WP_HAL_PORT_PIN P3_6
#define DDIC_WP P3_6
#define DDIC_WP_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define DDIC_WP_HAL_DIR CYHAL_GPIO_DIR_OUTPUT 
#define DDIC_WP_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_PULLDOWN
#endif /* defined (CY_USING_HAL) */

#define EXFLASH_SPI_SDI_ENABLED 1U
#define EXFLASH_SPI_SDI_PORT GPIO_PRT4
#define EXFLASH_SPI_SDI_PORT_NUM 4U
#define EXFLASH_SPI_SDI_PIN 0U
#define EXFLASH_SPI_SDI_NUM 0U
#define EXFLASH_SPI_SDI_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define EXFLASH_SPI_SDI_INIT_DRIVESTATE 1
#ifndef ioss_0_port_4_pin_0_HSIOM
    #define ioss_0_port_4_pin_0_HSIOM HSIOM_SEL_GPIO
#endif
#define EXFLASH_SPI_SDI_HSIOM ioss_0_port_4_pin_0_HSIOM
#define EXFLASH_SPI_SDI_IRQ ioss_interrupt_gpio_IRQn

#if defined (CY_USING_HAL)
#define EXFLASH_SPI_SDI_HAL_PORT_PIN P4_0
#define EXFLASH_SPI_SDI P4_0
#define EXFLASH_SPI_SDI_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define EXFLASH_SPI_SDI_HAL_DIR CYHAL_GPIO_DIR_OUTPUT 
#define EXFLASH_SPI_SDI_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_STRONG
#endif /* defined (CY_USING_HAL) */

#define EXFLASH_SPI_SDO_ENABLED 1U
#define EXFLASH_SPI_SDO_PORT GPIO_PRT4
#define EXFLASH_SPI_SDO_PORT_NUM 4U
#define EXFLASH_SPI_SDO_PIN 1U
#define EXFLASH_SPI_SDO_NUM 1U
#define EXFLASH_SPI_SDO_DRIVEMODE CY_GPIO_DM_HIGHZ
#define EXFLASH_SPI_SDO_INIT_DRIVESTATE 1
#ifndef ioss_0_port_4_pin_1_HSIOM
    #define ioss_0_port_4_pin_1_HSIOM HSIOM_SEL_GPIO
#endif
#define EXFLASH_SPI_SDO_HSIOM ioss_0_port_4_pin_1_HSIOM
#define EXFLASH_SPI_SDO_IRQ ioss_interrupt_gpio_IRQn

#if defined (CY_USING_HAL)
#define EXFLASH_SPI_SDO_HAL_PORT_PIN P4_1
#define EXFLASH_SPI_SDO P4_1
#define EXFLASH_SPI_SDO_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define EXFLASH_SPI_SDO_HAL_DIR CYHAL_GPIO_DIR_INPUT 
#define EXFLASH_SPI_SDO_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_NONE
#endif /* defined (CY_USING_HAL) */

#define EXFLASH_SPI_SCK_ENABLED 1U
#define EXFLASH_SPI_SCK_PORT GPIO_PRT4
#define EXFLASH_SPI_SCK_PORT_NUM 4U
#define EXFLASH_SPI_SCK_PIN 2U
#define EXFLASH_SPI_SCK_NUM 2U
#define EXFLASH_SPI_SCK_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define EXFLASH_SPI_SCK_INIT_DRIVESTATE 1
#ifndef ioss_0_port_4_pin_2_HSIOM
    #define ioss_0_port_4_pin_2_HSIOM HSIOM_SEL_GPIO
#endif
#define EXFLASH_SPI_SCK_HSIOM ioss_0_port_4_pin_2_HSIOM
#define EXFLASH_SPI_SCK_IRQ ioss_interrupt_gpio_IRQn

#if defined (CY_USING_HAL)
#define EXFLASH_SPI_SCK_HAL_PORT_PIN P4_2
#define EXFLASH_SPI_SCK P4_2
#define EXFLASH_SPI_SCK_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define EXFLASH_SPI_SCK_HAL_DIR CYHAL_GPIO_DIR_OUTPUT 
#define EXFLASH_SPI_SCK_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_STRONG
#endif /* defined (CY_USING_HAL) */

