zhixiangqi/CN_FW_FORD132CD542_APP_MCU/bsps/TARGET_FORD132_CD542_CY8C4147AZS-S285_POSA/config/GeneratedSource/cycfg_pins.h
#define EXFLASH_SPI_CS_ENABLED 1U
#define EXFLASH_SPI_CS_PORT GPIO_PRT4
#define EXFLASH_SPI_CS_PORT_NUM 4U
#define EXFLASH_SPI_CS_PIN 3U
#define EXFLASH_SPI_CS_NUM 3U
#define EXFLASH_SPI_CS_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define EXFLASH_SPI_CS_INIT_DRIVESTATE 1
#ifndef ioss_0_port_4_pin_3_HSIOM
    #define ioss_0_port_4_pin_3_HSIOM HSIOM_SEL_GPIO
#endif
#define EXFLASH_SPI_CS_HSIOM ioss_0_port_4_pin_3_HSIOM
#define EXFLASH_SPI_CS_IRQ ioss_interrupt_gpio_IRQn

#if defined (CY_USING_HAL)
#define EXFLASH_SPI_CS_HAL_PORT_PIN P4_3
#define EXFLASH_SPI_CS P4_3
#define EXFLASH_SPI_CS_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define EXFLASH_SPI_CS_HAL_DIR CYHAL_GPIO_DIR_OUTPUT 
#define EXFLASH_SPI_CS_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_STRONG
#endif /* defined (CY_USING_HAL) */

#define P3V3_PG_ENABLED 1U
#define P3V3_PG_PORT GPIO_PRT4
#define P3V3_PG_PORT_NUM 4U
#define P3V3_PG_PIN 4U
#define P3V3_PG_NUM 4U
#define P3V3_PG_DRIVEMODE CY_GPIO_DM_HIGHZ
#define P3V3_PG_INIT_DRIVESTATE 1
#ifndef ioss_0_port_4_pin_4_HSIOM
    #define ioss_0_port_4_pin_4_HSIOM HSIOM_SEL_GPIO
#endif
#define P3V3_PG_HSIOM ioss_0_port_4_pin_4_HSIOM
#define P3V3_PG_IRQ ioss_interrupt_gpio_IRQn

#if defined (CY_USING_HAL)
#define P3V3_PG_HAL_PORT_PIN P4_4
#define P3V3_PG P4_4
#define P3V3_PG_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define P3V3_PG_HAL_DIR CYHAL_GPIO_DIR_INPUT 
#define P3V3_PG_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_NONE
#endif /* defined (CY_USING_HAL) */

#define P3V3_EN_ENABLED 1U
#define P3V3_EN_PORT GPIO_PRT4
#define P3V3_EN_PORT_NUM 4U
#define P3V3_EN_PIN 5U
#define P3V3_EN_NUM 5U
#define P3V3_EN_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define P3V3_EN_INIT_DRIVESTATE 0
#ifndef ioss_0_port_4_pin_5_HSIOM
    #define ioss_0_port_4_pin_5_HSIOM HSIOM_SEL_GPIO
#endif
#define P3V3_EN_HSIOM ioss_0_port_4_pin_5_HSIOM
#define P3V3_EN_IRQ ioss_interrupt_gpio_IRQn

#if defined (CY_USING_HAL)
#define P3V3_EN_HAL_PORT_PIN P4_5
#define P3V3_EN P4_5
#define P3V3_EN_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define P3V3_EN_HAL_DIR CYHAL_GPIO_DIR_OUTPUT 
#define P3V3_EN_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_STRONG
#endif /* defined (CY_USING_HAL) */

#define VBATT_EN_ENABLED 1U
#define VBATT_EN_PORT GPIO_PRT4
#define VBATT_EN_PORT_NUM 4U
#define VBATT_EN_PIN 6U
#define VBATT_EN_NUM 6U
#define VBATT_EN_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define VBATT_EN_INIT_DRIVESTATE 0
#ifndef ioss_0_port_4_pin_6_HSIOM
    #define ioss_0_port_4_pin_6_HSIOM HSIOM_SEL_GPIO
#endif
#define VBATT_EN_HSIOM ioss_0_port_4_pin_6_HSIOM
#define VBATT_EN_IRQ ioss_interrupt_gpio_IRQn

#if defined (CY_USING_HAL)
#define VBATT_EN_HAL_PORT_PIN P4_6
#define VBATT_EN P4_6
#define VBATT_EN_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define VBATT_EN_HAL_DIR CYHAL_GPIO_DIR_OUTPUT 
#define VBATT_EN_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_STRONG
#endif /* defined (CY_USING_HAL) */

#define LED_EN_ENABLED 1U
#define LED_EN_PORT GPIO_PRT4
#define LED_EN_PORT_NUM 4U
#define LED_EN_PIN 7U
#define LED_EN_NUM 7U
#define LED_EN_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define LED_EN_INIT_DRIVESTATE 0
#ifndef ioss_0_port_4_pin_7_HSIOM
    #define ioss_0_port_4_pin_7_HSIOM HSIOM_SEL_GPIO
#endif
#define LED_EN_HSIOM ioss_0_port_4_pin_7_HSIOM
#define LED_EN_IRQ ioss_interrupt_gpio_IRQn

#if defined (CY_USING_HAL)
#define LED_EN_HAL_PORT_PIN P4_7
#define LED_EN P4_7
#define LED_EN_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define LED_EN_HAL_DIR CYHAL_GPIO_DIR_OUTPUT 
#define LED_EN_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_STRONG
#endif /* defined (CY_USING_HAL) */

#define HVLDO_EN_ENABLED 1U
#define HVLDO_EN_PORT GPIO_PRT5
#define HVLDO_EN_PORT_NUM 5U
#define HVLDO_EN_PIN 0U
#define HVLDO_EN_NUM 0U
#define HVLDO_EN_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define HVLDO_EN_INIT_DRIVESTATE 0
#ifndef ioss_0_port_5_pin_0_HSIOM
    #define ioss_0_port_5_pin_0_HSIOM HSIOM_SEL_GPIO
#endif
#define HVLDO_EN_HSIOM ioss_0_port_5_pin_0_HSIOM
#define HVLDO_EN_IRQ ioss_interrupt_gpio_IRQn

#if defined (CY_USING_HAL)
#define HVLDO_EN_HAL_PORT_PIN P5_0
#define HVLDO_EN P5_0
#define HVLDO_EN_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define HVLDO_EN_HAL_DIR CYHAL_GPIO_DIR_OUTPUT 
#define HVLDO_EN_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_STRONG
#endif /* defined (CY_USING_HAL) */

#define DES_INTB_ENABLED 1U
#define DES_INTB_PORT GPIO_PRT5
#define DES_INTB_PORT_NUM 5U
#define DES_INTB_PIN 3U
#define DES_INTB_NUM 3U
#define DES_INTB_DRIVEMODE CY_GPIO_DM_PULLDOWN_IN_OFF
#define DES_INTB_INIT_DRIVESTATE 0
#ifndef ioss_0_port_5_pin_3_HSIOM
    #define ioss_0_port_5_pin_3_HSIOM HSIOM_SEL_GPIO
#endif
#define DES_INTB_HSIOM ioss_0_port_5_pin_3_HSIOM
#define DES_INTB_IRQ ioss_interrupt_gpio_IRQn

#if defined (CY_USING_HAL)
#define DES_INTB_HAL_PORT_PIN P5_3
#define DES_INTB P5_3
#define DES_INTB_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define DES_INTB_HAL_DIR CYHAL_GPIO_DIR_OUTPUT 
#define DES_INTB_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_PULLDOWN
#endif /* defined (CY_USING_HAL) */

#define DES_PDB_ENABLED 1U
#define DES_PDB_PORT GPIO_PRT5
#define DES_PDB_PORT_NUM 5U
#define DES_PDB_PIN 5U
#define DES_PDB_NUM 5U
#define DES_PDB_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define DES_PDB_INIT_DRIVESTATE 0
#ifndef ioss_0_port_5_pin_5_HSIOM
    #define ioss_0_port_5_pin_5_HSIOM HSIOM_SEL_GPIO
#endif
#define DES_PDB_HSIOM ioss_0_port_5_pin_5_HSIOM
#define DES_PDB_IRQ ioss_interrupt_gpio_IRQn

#if defined (CY_USING_HAL)
#define DES_PDB_HAL_PORT_PIN P5_5
#define DES_PDB P5_5
#define DES_PDB_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define DES_PDB_HAL_DIR CYHAL_GPIO_DIR_OUTPUT 
#define DES_PDB_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_STRONG
#endif /* defined (CY_USING_HAL) */

#define LED_DIM_ENABLED 1U
#define LED_DIM_PORT GPIO_PRT5
#define LED_DIM_PORT_NUM 5U
#define LED_DIM_PIN 6U
#define LED_DIM_NUM 6U
#define LED_DIM_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define LED_DIM_INIT_DRIVESTATE 1
#ifndef ioss_0_port_5_pin_6_HSIOM
    #define ioss_0_port_5_pin_6_HSIOM HSIOM_SEL_GPIO
#endif
#define LED_DIM_HSIOM ioss_0_port_5_pin_6_HSIOM
#define LED_DIM_IRQ ioss_interrupt_gpio_IRQn

#if defined (CY_USING_HAL)
#define LED_DIM_HAL_PORT_PIN P5_6
#define LED_DIM P5_6
#define LED_DIM_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define LED_DIM_HAL_DIR CYHAL_GPIO_DIR_OUTPUT 
#define LED_DIM_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_STRONG
#endif /* defined (CY_USING_HAL) */

#define LED_FAULT_ENABLED 1U
#define LED_FAULT_PORT GPIO_PRT5
#define LED_FAULT_PORT_NUM 5U
#define LED_FAULT_PIN 7U
#define LED_FAULT_NUM 7U
#define LED_FAULT_DRIVEMODE CY_GPIO_DM_HIGHZ
#define LED_FAULT_INIT_DRIVESTATE 1
#ifndef ioss_0_port_5_pin_7_HSIOM
    #define ioss_0_port_5_pin_7_HSIOM HSIOM_SEL_GPIO
#endif
#define LED_FAULT_HSIOM ioss_0_port_5_pin_7_HSIOM
#define LED_FAULT_IRQ ioss_interrupt_gpio_IRQn

#if defined (CY_USING_HAL)
#define LED_FAULT_HAL_PORT_PIN P5_7
#define LED_FAULT P5_7
#define LED_FAULT_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define LED_FAULT_HAL_DIR CYHAL_GPIO_DIR_INPUT 
#define LED_FAULT_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_NONE
#endif /* defined (CY_USING_HAL) */

#define DES_BISTEN_ENABLED 1U
#define DES_BISTEN_PORT GPIO_PRT6
#define DES_BISTEN_PORT_NUM 6U
#define DES_BISTEN_PIN 0U
#define DES_BISTEN_NUM 0U
#define DES_BISTEN_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define DES_BISTEN_INIT_DRIVESTATE 0
#ifndef ioss_0_port_6_pin_0_HSIOM
    #define ioss_0_port_6_pin_0_HSIOM HSIOM_SEL_GPIO
#endif
#define DES_BISTEN_HSIOM ioss_0_port_6_pin_0_HSIOM
#define DES_BISTEN_IRQ ioss_interrupt_gpio_IRQn

#if defined (CY_USING_HAL)
#define DES_BISTEN_HAL_PORT_PIN P6_0
#define DES_BISTEN P6_0
#define DES_BISTEN_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define DES_BISTEN_HAL_DIR CYHAL_GPIO_DIR_OUTPUT 
#define DES_BISTEN_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_STRONG
#endif /* defined (CY_USING_HAL) */

#define DISP_RESX_ENABLED 1U
#define DISP_RESX_PORT GPIO_PRT6
#define DISP_RESX_PORT_NUM 6U
#define DISP_RESX_PIN 1U
#define DISP_RESX_NUM 1U
#define DISP_RESX_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define DISP_RESX_INIT_DRIVESTATE 0
#ifndef ioss_0_port_6_pin_1_HSIOM
    #define ioss_0_port_6_pin_1_HSIOM HSIOM_SEL_GPIO
#endif
#define DISP_RESX_HSIOM ioss_0_port_6_pin_1_HSIOM
#define DISP_RESX_IRQ ioss_interrupt_gpio_IRQn

#if defined (CY_USING_HAL)
#define DISP_RESX_HAL_PORT_PIN P6_1
#define DISP_RESX P6_1
#define DISP_RESX_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define DISP_RESX_HAL_DIR CYHAL_GPIO_DIR_OUTPUT 
#define DISP_RESX_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_STRONG
#endif /* defined (CY_USING_HAL) */

