zhixiangqi/CN_FW_FORD132CD542_APP_MCU/bsps/TARGET_FORD132_CD542_CY8C4147AZS-S285_POSA/config/GeneratedSource/cycfg_pins.h
#define DISP_STBY_ENABLED 1U
#define DISP_STBY_PORT GPIO_PRT6
#define DISP_STBY_PORT_NUM 6U
#define DISP_STBY_PIN 2U
#define DISP_STBY_NUM 2U
#define DISP_STBY_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define DISP_STBY_INIT_DRIVESTATE 0
#ifndef ioss_0_port_6_pin_2_HSIOM
    #define ioss_0_port_6_pin_2_HSIOM HSIOM_SEL_GPIO
#endif
#define DISP_STBY_HSIOM ioss_0_port_6_pin_2_HSIOM
#define DISP_STBY_IRQ ioss_interrupt_gpio_IRQn

#if defined (CY_USING_HAL)
#define DISP_STBY_HAL_PORT_PIN P6_2
#define DISP_STBY P6_2
#define DISP_STBY_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define DISP_STBY_HAL_DIR CYHAL_GPIO_DIR_OUTPUT 
#define DISP_STBY_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_STRONG
#endif /* defined (CY_USING_HAL) */

#define MCU_I2C_SCL_ENABLED 1U
#define MCU_I2C_SCL_PORT GPIO_PRT6
#define MCU_I2C_SCL_PORT_NUM 6U
#define MCU_I2C_SCL_PIN 4U
#define MCU_I2C_SCL_NUM 4U
#define MCU_I2C_SCL_DRIVEMODE CY_GPIO_DM_OD_DRIVESLOW
#define MCU_I2C_SCL_INIT_DRIVESTATE 1
#ifndef ioss_0_port_6_pin_4_HSIOM
    #define ioss_0_port_6_pin_4_HSIOM HSIOM_SEL_GPIO
#endif
#define MCU_I2C_SCL_HSIOM ioss_0_port_6_pin_4_HSIOM
#define MCU_I2C_SCL_IRQ ioss_interrupt_gpio_IRQn

#if defined (CY_USING_HAL)
#define MCU_I2C_SCL_HAL_PORT_PIN P6_4
#define MCU_I2C_SCL P6_4
#define MCU_I2C_SCL_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define MCU_I2C_SCL_HAL_DIR CYHAL_GPIO_DIR_BIDIRECTIONAL 
#define MCU_I2C_SCL_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_OPENDRAINDRIVESLOW
#endif /* defined (CY_USING_HAL) */

#define MCU_I2C_SDA_ENABLED 1U
#define MCU_I2C_SDA_PORT GPIO_PRT6
#define MCU_I2C_SDA_PORT_NUM 6U
#define MCU_I2C_SDA_PIN 5U
#define MCU_I2C_SDA_NUM 5U
#define MCU_I2C_SDA_DRIVEMODE CY_GPIO_DM_OD_DRIVESLOW
#define MCU_I2C_SDA_INIT_DRIVESTATE 1
#ifndef ioss_0_port_6_pin_5_HSIOM
    #define ioss_0_port_6_pin_5_HSIOM HSIOM_SEL_GPIO
#endif
#define MCU_I2C_SDA_HSIOM ioss_0_port_6_pin_5_HSIOM
#define MCU_I2C_SDA_IRQ ioss_interrupt_gpio_IRQn

#if defined (CY_USING_HAL)
#define MCU_I2C_SDA_HAL_PORT_PIN P6_5
#define MCU_I2C_SDA P6_5
#define MCU_I2C_SDA_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define MCU_I2C_SDA_HAL_DIR CYHAL_GPIO_DIR_BIDIRECTIONAL 
#define MCU_I2C_SDA_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_OPENDRAINDRIVESLOW
#endif /* defined (CY_USING_HAL) */

#define DEBUG_UART_RX_ENABLED 1U
#define DEBUG_UART_RX_PORT GPIO_PRT7
#define DEBUG_UART_RX_PORT_NUM 7U
#define DEBUG_UART_RX_PIN 0U
#define DEBUG_UART_RX_NUM 0U
#define DEBUG_UART_RX_DRIVEMODE CY_GPIO_DM_HIGHZ
#define DEBUG_UART_RX_INIT_DRIVESTATE 0
#ifndef ioss_0_port_7_pin_0_HSIOM
    #define ioss_0_port_7_pin_0_HSIOM HSIOM_SEL_GPIO
#endif
#define DEBUG_UART_RX_HSIOM ioss_0_port_7_pin_0_HSIOM
#define DEBUG_UART_RX_IRQ ioss_interrupt_gpio_IRQn

#if defined (CY_USING_HAL)
#define DEBUG_UART_RX_HAL_PORT_PIN P7_0
#define DEBUG_UART_RX P7_0
#define DEBUG_UART_RX_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define DEBUG_UART_RX_HAL_DIR CYHAL_GPIO_DIR_INPUT 
#define DEBUG_UART_RX_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_NONE
#endif /* defined (CY_USING_HAL) */

#define DEBUG_UART_TX_ENABLED 1U
#define DEBUG_UART_TX_PORT GPIO_PRT7
#define DEBUG_UART_TX_PORT_NUM 7U
#define DEBUG_UART_TX_PIN 1U
#define DEBUG_UART_TX_NUM 1U
#define DEBUG_UART_TX_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define DEBUG_UART_TX_INIT_DRIVESTATE 1
#ifndef ioss_0_port_7_pin_1_HSIOM
    #define ioss_0_port_7_pin_1_HSIOM HSIOM_SEL_GPIO
#endif
#define DEBUG_UART_TX_HSIOM ioss_0_port_7_pin_1_HSIOM
#define DEBUG_UART_TX_IRQ ioss_interrupt_gpio_IRQn

#if defined (CY_USING_HAL)
#define DEBUG_UART_TX_HAL_PORT_PIN P7_1
#define DEBUG_UART_TX P7_1
#define DEBUG_UART_TX_HAL_IRQ CYHAL_GPIO_IRQ_NONE
#define DEBUG_UART_TX_HAL_DIR CYHAL_GPIO_DIR_OUTPUT 
#define DEBUG_UART_TX_HAL_DRIVEMODE CYHAL_GPIO_DRIVE_STRONG
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t PCBA_A0_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t PCBA_A0_obj;
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t PCBA_A1_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t PCBA_A1_obj;
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t PCBA_A2_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t PCBA_A2_obj;
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t PCBA_A3_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t PCBA_A3_obj;
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t RTC_WCO_IN_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t RTC_WCO_IN_obj;
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t RTC_WCO_OUT_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t RTC_WCO_OUT_obj;
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t P1V2_EN_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t P1V2_EN_obj;
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t P1V2_PG_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t P1V2_PG_obj;
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t BIAS_FAULT_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t BIAS_FAULT_obj;
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t BIAS_EN_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t BIAS_EN_obj;
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t DES_I2C_SCL_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t DES_I2C_SCL_obj;
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t DES_I2C_SDA_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t DES_I2C_SDA_obj;
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t ioss_0_port_1_pin_7_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t ioss_0_port_1_pin_7_obj;
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t ADC_PCBTEMP_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t ADC_PCBTEMP_obj;
#endif /* defined (CY_USING_HAL) */

