zhixiangqi/CN_FW_FORD132CD542_APP_MCU/bsps/TARGET_FORD132_CD542_CY8C4147AZS-S285_POSA/config/GeneratedSource/cycfg_pins.h
extern const cy_stc_gpio_pin_config_t ADC_BLTTEMP_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t ADC_BLTTEMP_obj;
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t ADC_BATTVOLT_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t ADC_BATTVOLT_obj;
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t ADC_SYNCCHECK_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t ADC_SYNCCHECK_obj;
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t FPC_DET_TX_LOUT_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t FPC_DET_TX_LOUT_obj;
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t FPC_DET_RX_ROUT_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t FPC_DET_RX_ROUT_obj;
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t DES_LOCK_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t DES_LOCK_obj;
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t DES_PASS_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t DES_PASS_obj;
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t EXFLASH_WP_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t EXFLASH_WP_obj;
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t DISP_FAULT_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t DISP_FAULT_obj;
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t MCU_SWDIO_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t MCU_SWDIO_obj;
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t MCU_SWCLK_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t MCU_SWCLK_obj;
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t U301_TSC_ATTN_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t U301_TSC_ATTN_obj;
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t U301_TSC_RESET_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t U301_TSC_RESET_obj;
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t DDIC_WP_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t DDIC_WP_obj;
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t EXFLASH_SPI_SDI_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t EXFLASH_SPI_SDI_obj;
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t EXFLASH_SPI_SDO_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t EXFLASH_SPI_SDO_obj;
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t EXFLASH_SPI_SCK_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t EXFLASH_SPI_SCK_obj;
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t EXFLASH_SPI_CS_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t EXFLASH_SPI_CS_obj;
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t P3V3_PG_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t P3V3_PG_obj;
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t P3V3_EN_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t P3V3_EN_obj;
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t VBATT_EN_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t VBATT_EN_obj;
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t LED_EN_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t LED_EN_obj;
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t HVLDO_EN_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t HVLDO_EN_obj;
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t DES_INTB_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t DES_INTB_obj;
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t DES_PDB_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t DES_PDB_obj;
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t LED_DIM_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t LED_DIM_obj;
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t LED_FAULT_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t LED_FAULT_obj;
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t DES_BISTEN_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t DES_BISTEN_obj;
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t DISP_RESX_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t DISP_RESX_obj;
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t DISP_STBY_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t DISP_STBY_obj;
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t MCU_I2C_SCL_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t MCU_I2C_SCL_obj;
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t MCU_I2C_SDA_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t MCU_I2C_SDA_obj;
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t DEBUG_UART_RX_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t DEBUG_UART_RX_obj;
#endif /* defined (CY_USING_HAL) */

extern const cy_stc_gpio_pin_config_t DEBUG_UART_TX_config;

#if defined (CY_USING_HAL)
extern const cyhal_resource_inst_t DEBUG_UART_TX_obj;
#endif /* defined (CY_USING_HAL) */

void init_cycfg_pins(void);
void reserve_cycfg_pins(void);

#if defined(__cplusplus)
}
#endif /* defined(__cplusplus) */

#endif /* CYCFG_PINS_H */
